import numpy as np
from scipy.special import gamma

'''
Аргон 18. Конфигурационный файл.
'''

# Параметры
n_atoms = 1000  # число атомов
intensity = 2.15e22  # [Вт/см^2] Интенсивность поля в фокусе
w_0 = 2.654  # радиус перетяжки гауссова пучка в длинах волн
tau = 44.  # длительность импульса в единицах 1/omega
t_0 = 1000.  # длительность моделирования в единицах 1/omega
t_electron = 1.e4  # длительность моделирования электронов в единицах 1/omega
delta_t = 0.001  # разрешение по времени
z_max = 18  # максимальное зарядовое число
start_charge_number_of_particles = 8  # 0 - ионизуем нейтральные атомы (начальное число Z - 1)
c = 1.  # масштаб для формы form мишени
form = np.array([110., 16., 16.]) * w_0
# форма ящика с атомами в формате длина по X, длина по Y и длина по Z.
# импульс распространаяется вдоль оси X, расстояния указываются в длинах волн.
longitudinal_component = False  # True - если есть продольная компонента магнитного поля
eps = 0.  # эллиптичность поля
right_or_left = +1  # +1 - правая поляризация, -1 - левая поляризация

wavelength = 0.8  # [мкм] Длина волны. Не участвует в симуляции непосредственно, но используется для расчета
# Промежуточных констант ниже
gauss_wavelength = wavelength * 1e-4  # [см] Длина волны в СГС

# Физические константы и единицы измерений
thin_structure_constant = 1/137  # Постоянная тонкой структуры
speed_of_light = 2.99792458e10  # [см/с] Скорость света в вакууме
a_B = 0.529177210903e-8  # [см] Боровский радиус
e_0 = 4.80320471257e-10  # [ед. СГС] Элементарный заряд
m_e = 0.91093837015e-27  # [г] Масса электрона
electron_mass = 0.51099895069  # [МэВ] Масса электрона
atomic_frequency_unit = 4.1e16  # [1/с] Атомная единица частоты
atomic_intensity_unit = 3.5e16  # [Вт/см^2] Атомная единица интенсивности
hartree_energy = m_e * speed_of_light ** 2 * thin_structure_constant ** 2  # [эрг] Атомная единица энергии
gauss_electric_field_unit = hartree_energy / (e_0 * a_B)  # [ед. СГС] Атомная единица напряженности эл. поля в СГС
one_erg_in_joules = 1e-7  # [Дж] 1 эрг в Джоулях

# Промежуточные константы, вычисляются по Параметрам и физическим константам
frequency = 2 * np.pi * 2.997925e8 / (wavelength * 1e-6)  # [1/с] Частота поля
atomic_frequency = frequency / atomic_frequency_unit  # [ат. ед.] Частота поля в атомных единицах

atomic_field = np.sqrt(intensity / (atomic_intensity_unit * (1 + eps ** 2)))  # [ат. ед.] Амплитуда поля в симуляции
gauss_field = atomic_field * gauss_electric_field_unit  # [ед. СГС] Амплитуда поля в симуляции в СГС

a_0 = atomic_field / (137 * atomic_frequency)  # единица поля для решения уравнений Лоренца для электронов
mass_coefficient = 8e4  # во сколько раз масса иона больше массы электрона
a_0_ion = a_0 / mass_coefficient  # единица поля для решения уравнения Лоренца для ионов (заряд не учитывается)

# Потенциалы ионизации
ionization_potentials = np.array([
    15.76,
    27.63,
    40.74,
    59.81,
    75.02,
    91.01,
    124.32,
    143.46,
    422.45,
    478.69,
    538.96,
    618.26,
    686.10,
    755.74,
    854.77,
    918.03,
    4120.89,
    4426.23
]) / 27.20


# Порядок ионизации
ionization_order_array = np.array([
    [1, 1, 0, 1],
    [2, 1, 0, 1],
    [3, 1, 0, 1],
    [4, 1, 0, 1],
    [5, 1, 0, 1],
    [6, 1, 0, 1],
    [7, 0, 0, 1],
    [8, 0, 0, 1],
    [9, 1, 0, 1],
    [10, 1, 0, 1],
    [11, 1, 0, 1],
    [12, 1, 0, 1],
    [13, 1, 0, 1],
    [14, 1, 0, 1],
    [15, 0, 0, 1],  # 2s
    [16, 0, 0, 1],  # 2s
    [17, 0, 0, 1],  # 1s
    [18, 0, 0, 1]  # 1s
])

'''
ionization_order_array = np.array([
    [1, 1, 0, 2],
    [2, 1, 0, 1],
    [3, 1, -1, 4],
    [4, 1, -1, 3],
    [5, 1, 1, 2],
    [6, 1, 1, 1],
    [7, 0, 0, 2],
    [8, 0, 0, 1],
    [9, 1, 0, 2],
    [10, 1, 0, 1],
    [11, 1, -1, 4],
    [12, 1, -1, 3],
    [13, 1, 1, 2],
    [14, 1, 1, 1],
    [15, 0, 0, 2],
    [16, 0, 0, 1],
    [17, 0, 0, 2],
    [18, 0, 0, 1]
])
'''

n_star_array = ionization_order_array[:, 0] / np.sqrt(2 * ionization_potentials)

input_array = np.column_stack((
    n_star_array,
    ionization_order_array[:, 1],  # значения l
    ionization_order_array[:, 2]   # значения m
))


# Функции, считающая коэффициенты C и B в w_ppt и w_ppt_vectorized
def c_n_l_squared(elem):
    return 2 ** (2 * elem[:, 0] - 2) / (elem[:, 0] * gamma(elem[:, 0] + elem[:, 1] + 1) *
                                        gamma(elem[:, 0] - elem[:, 1]))


def b_l_m(elem):
    return (2 * elem[:, 1] + 1) * gamma(elem[:, 1] + abs(elem[:, 2]) + 1)\
           / (2 ** abs(elem[:, 2]) * gamma(abs(elem[:, 2]) + 1) * gamma(elem[:, 1] - abs(elem[:, 2]) + 1))


# Заполнение массивов коэффициентов B и C
c_n_l_array = c_n_l_squared(input_array)
c_n_l_array[0] = 1.
b_l_m_array = b_l_m(input_array)
